Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །འདི་འདྲའི་སེམས་དང་ས་ཐོབ་ལྷན་ཅིག་མངོན་པར་སྐྱེ།
en: “Once this aspiration is developed, the bhūmi is attained.

source: །བསམ་པ་མྱི་གཡོ་རི་ཡི་རྒྱལ་པོ་འདྲ་བར་གནས།
en: Their motivation becomes as unshakable as the king of mountains.

source: །རབ་ཏུ་དགའ་ཞིང་སྤྲོས་མང་དད་དང་ལྡན་པ་སྟེ།
en: They have a plenitude of joy and happiness, and they have admiration.

source: །མོས་པའི་ཤུགས་ཡངས་རྟག་པར་སེམས་ཀྱི་མཆོག་དང་ལྡན།
en: They have a plenitude of enthusiasm’s power and always the supreme motivation.

source: །འཁྲུགས་དང་འཚེ་བ་མྱེད་ཅིང་ཁྲོ་བ་མྱེད་པ་སྟེ།
en: “They are calm, harmless, and without anger.

source: །ངོ་ཚ་ཤེས་ཤིང་སྲི་ཞུ་དྲན་ལྡན་ཤིན་ཏུ་བསྡམས།
en: They know shame and are respectful, honest, and self-disciplined.

source: །འགྲོ་བ་ཡོངས་སུ་བསྐྱབ་པའི་མཚུངས་མེད་ཡེ་ཤེས་དྲན་གྱུར་ཅིང་།
en: They are mindful of the incomparable wisdom of saving beings.

source: འདོད་པར་བྱ་བའི་གནས་དང་ལྡན་གྱུར་དགའ་བ་སྐྱེད།
en: They are happy in having attained the state they longed for.

source: །ས་ཐོབ་གྱུར་མ་ཐག་ཏུ་འཇིགས་པ་ལྔ་དང་བྲལ།
en: “On attaining this bhūmi they become free from five fears:

source: །འཚོ་བ་མེད་དང་འཆི་དང་མི་བསྔགས་ངན་འགྲོ་དང་། །འཁོར་གྱི་འཇིགས་བྲལ་དེ་ལ་བག་ཚའི་རྣམ་པ་མྱེད།
en: They are free from the fear of having no livelihood, of death, of not being praised, Of the lower existences, and of assemblies, and thus they are without fear.

source: །ཅི་ཕྱིར་ཞེ་ན་དེ་ལ་བདག་གི་གནས་མྱེད་དོ།
en: Why is that? Because there is no presence of the self.

source: །དེ་དག་བག་ཚ་བྲལ་ཞིང་སྙིང་རྗེ་བྱམས་དང་ལྡན།
en: “They are free from fear and have kindness and love.

source: །བསྟི་སྟང་དང་ལྡན་དགའ་བ་ཕུན་སུམ་ཡོན་ཏན་མང་།
en: They have respect, a sense of shame, and many good qualities.

source: །ཉིན་དང་མཚན་དུ་དགེ་བའི་ཕྱོགས་ལ་སྟེན་བྱེད་ཅིང་།
en: They practice goodness night and day.

source: །སེམས་ཅན་དོན་དུ་ཆོས་བརྩོན་འདོད་བསྐྱེད་ཕྱིར་མ་ཡིན།
en: They delight in the Dharma for the sake of beings, not for the pleasure of desires.

source: །དགེ་བའི་ཆོས་ཐོས་བསམ་ལ་མཁས་ཤིང་གནས་མྱེད་སྤྱོད།
en: “They are skilled in contemplating the Dharma, and their minds are without fixation.

source: །འཐོབ་སེམས་སྲེད་བྲལ་བྱང་ཆུབ་སེམས་ལ་རྟག་པར་དགའ།
en: They are free from acquisitiveness and craving and always delight in bodhicitta.

source: །བདེ་གཤེགས་ཡེ་ཤེས་འདོད་ཅིང་གཞན་དུ་སེམས་པ་མེད།
en: They aspire to the Buddha’s wisdom, the pure strengths, and the Buddhadharma.

source: །ཕ་རོལ་ཕྱིན་པ་ཚོལ་ཞིང་སྒྱུ་དང་གཡོ་ཡང་སྤངས།
en: They seek the perfections and have rejected deception and deceit.

source: །ཅི་སྨྲས་དེ་བཞིན་བྱེད་པས་བདེན་པའི་ཚིག་ལ་གནས།
en: “They practice what they preach, and they always keep to speaking the truth.

source: །རྒྱལ་བའི་རིགས་སྐྱོན་མི་འགྱུར་བྱང་ཆུབ་སློབ་ལ་སྤྱོད།
en: They do not violate the family of the jinas, and they practice the training for enlightenment.

source: །འཇིག་རྟེན་ལས་ཀྱི་བསམ་བྲལ་འགྲོ་བའི་དོན་དུ་བརྩོན།
en: They are free of concerns for worldly activities and delight in benefiting beings.

source: །དཀར་པོས་ངོམས་པ་མེད་པར་ཕྱིར་ཞིང་གོང་དུ་རྩོལ།
en: They are never satisfied with their good actions and commence upon the higher bhūmis.

source: །དེ་དག་འདི་འདྲའི་ཆོས་བརྩོན་ཡོན་ཏན་དོན་དང་ལྡན།
en: “They delight in the Dharma and are endowed with qualities and benefits.

source: །རྒྱལ་བ་བལྟ་བའི་དོན་དུ་སྨོན་ལམ་མངོན་པར་སྒྲུབ།
en: They accomplish the prayer to see the jinas.

source: །དམ་ཆོས་ཡོངས་སུ་གཟུང་ཞིང་དྲང་སྲོང་དྲུང་འགྲོ་དང་། །སྤྱོད་པ་མཆོག་གི་དོན་དུ་སྨོན་ལམ་མངོན་པར་སྒྲུབ།
en: They possess the holy Dharma and come into the presence of the sages. They accomplish the prayer to have supreme conduct.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱ་སངས་རྒྱས་ཞིང་སྦྱངས་ཏེ།
en: “They ripen beings, and buddha realms are purified.

source: །དེ་ཡི་ཞིང་མཆོག་རྒྱལ་སྲས་ཀུན་གྱིས་གང་འགྱུར་ཞིང་།
en: Their realms are filled with bodhisattvas.

source: །རྒྱལ་སྲས་རྣམས་དང་བསམ་པ་གཅིག་ཅིང་དོན་མཐུན་ཕྱིར།
en: They have the one unfailing intention of bodhisattvas

source: །སྐྲ་སྦུབས་ཀུན་ཏུ་དོན་གྱི་དམ་པ་མངོན་འཚང་རྒྱ།
en: In all the existences of childlike beings, for the sake of their enlightenment.

source: །དེ་དག་སྨོན་ལམ་དུ་མ་མངོན་པར་བསྒྲུབ་པ་བྱེད།
en: “They accomplish many prayers

source: །དེ་དག་མཐའ་ཡས་ཡངས་ཤིང་མཐར་ཐུག་མེད་དང་ལྡན།
en: And they are infinite, extensive, and endless: ‘Like the end of space, beings, phenomena, nirvāṇa,

source: །ནམ་མཁའི་ཁམས་དང་ཆོས་ཉིད་མྱ་ངན་འདས་ཁམས་དང་། །འཇིག་རྟེན་མཐར་ཐུག་རྒྱལ་བ་འབྱུང་དང་ཡེ་ཤེས་ས།
en: The world, the appearance of jinas, and the wisdom bhūmi,

source: །སེམས་ཀྱི་ཡུལ་དང་ཡེ་ཤེས་འཇུག་པའི་མཐར་ཐུག་དང་། །རྣམ་གསུམ་རྒྱུད་རྣམས་མཐར་ཐུག་འགྲོ་བའི་མུར་ཐུག་པ།
en: ‘Like the end of the mind’s range of activity and the accomplishment of wisdom, Like the end of the three continuities at the end of existences,

source: །རྣམ་པ་དེ་ཚུལ་བདག་སྨོན་མཐར་ཡང་ཐུག་གྱུར་ཅིང་།
en: May my prayers likewise never have an end.

source: །དེ་དག་མཐར་ཐུག་ཇི་བཞིན་བདག་སྤྱོད་དེ་འདྲར་ཤོག །དེ་ལྟར་མངོན་བསྒྲུབས་འཇམ་ཞིང་བྱམས་པའི་སེམས་ལྡན་པ།
en: And in that same way may the conduct I adopt have no end. “ ‘Just as they accomplished gentle and loving minds,

source: །སངས་རྒྱས་ཡོན་ཏན་ཡིད་ཆེས་སེམས་ཅན་རྣམ་པར་ལྟ། །སེམས་ཅན་སྡུག་བསྔལ་ཉོན་མོངས་བདག་གིས་བསྐྱབ་ཅེས་ཏེ།
en: Have conviction in the Buddha’s qualities, and regard beings,

source: །རྟེན་འབྲེལ་འབྱུང་འཇུག་སྙིང་རྗེ་བྱམས་དང་ལྡན་པ་ནི།
en: May I have compassion and love attained through dependent origination, And may I save beings from being tormented by suffering.’

source: དེ་དག་དོན་དུ་སྣ་ཚོགས་སྦྱིན་པ་ཡང་དུ་རྩོམ།
en: “For that purpose, they engage in various acts of generosity. Without sadness, they give away everything:

source: །རྒྱལ་སྲིད་མཆོག་དང་རིན་ཆེན་སྣ་ཚོགས་གླང་པོ་རྟ།
en: The most excellent kingship; all kinds of jewels; elephants and horses;

source: །མགོ་དང་རྐང་ལག་མྱིག་དང་དེ་བཞིན་བདག་ཉིད་ཤ། །ཐམས་ཅད་ཡོངས་སུ་གཏང་ཡང་ཞུམ་པའི་ཡིད་མྱེད་དོ།
en: Their heads, legs, arms, eyes, and their own flesh.

source: །གཙུག་ལག་སྣ་ཚོགས་ཚོལ་ཡང་ཡོངས་སུ་སྐྱོ་བ་མྱེད།
en: “They are indefatigable in seeking all kinds of learning;

source: །གཙུག་ལག་འཇིག་རྟེན་སྤྱོད་པའི་རྗེས་ཀྱང་བར་དུ་སྙེགས།
en: They pursue knowledge in the learning of worldly activities,

source: །འཇིག་རྟེན་ཤེས་དང་ལྡན་ཞིང་ཁྲེལ་ཡོད་དགའ་དང་ལྡན།
en: And having gained worldly knowledge they have a stable sense of shame

source: །བདེ་གཤེགས་གཅིག་མྱིན་རིམ་གྲོ་རྗེས་སུ་མཆོད་པ་བྱེད།
en: And serve and make offerings to many sugatas.

source: །དེ་ལྟར་མཁས་པ་ཉིན་མཚན་རྟག་ཏུ་བརྩོན་པ་ཡི།
en: “The wise ones are always engaged in this day and night,

source: །དགེ་བ་མྱེད་བཅུག་གསེར་བཞིན་ཤིན་ཏུ་དག་པར་འགྱུར།
en: And their good actions become pure like gold in fire.

source: །དེ་དག་ས་རྣམས་བཅུ་པོ་འདི་ལ་སྦྱངས་བྱས་ཤིང་།
en: They also refine the ten bhūmis,

source: །ཐོགས་པ་མྱེད་པར་ཆགས་མེད་རབ་ཏུ་ཐོབ་པར་འགྱུར།
en: Attaining them without impediment or obstruction.

source: །ཇི་ལྟར་དེད་དཔོན་ལམ་གྲོགས་མང་ལ་ཕན་བརྩོན་པ།
en: “Just as a caravan leader, for the benefit of a great caravan,

source: །ལམ་གྱི་ཡོན་ཏན་དྲི་ཞིང་བདེ་བའི་གྲོང་དུ་སྐྱེལ།
en: Inquires about the good qualities of the route and brings it to safety,

source: །དེ་བཞིན་བྱང་ཆུབ་སེམས་དཔའ་དང་པོའི་ས་གནས་པ།
en: In the same way, the bodhisattva on the first bhūmi

source: །འགྲོ་བའི་དོན་བཤམས་ཆགས་མེད་ས་བཅུ་རབ་ཏུ་འཐོབ།
en: Sets out for and attains the ten bhūmis without impediment.

source: །འདི་གནས་ཡོན་ཏན་ལྡན་པ་མི་ཡི་དབང་པོར་འགྱུར།
en: “Those on this bhūmi, who possess qualities, become rulers of humans.

source: །བྱམས་པའི་སེམས་ཀྱིས་ས་རྣམས་ཡོངས་སུ་སྐྱོང་།
en: With a loving mind they protect the Dharma.

source: །འཛམ་བུའི་རྒྱལ་མཚན་སྲིད་ཀུན་རབ་ཏུ་སྐྱོང་བྱེད་ཅིང་།
en: They become monarchs over entire Jambudhvajas

source: །སྦྱིན་པས་འགྲོ་བ་སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ལ་དགོད།
en: And, through generosity, establish beings in the supreme wisdom of buddhahood.

source: །ཁྱུ་མཆོག་དམ་པ་འདོད་ན་རྒྱལ་སྲིད་རབ་ཏུ་གཏོང་།
en: “These great leaders, if they wish, can give up their kingdoms,

source: །རྒྱལ་བའི་བསྟན་པ་རབ་ཏུ་བྱུང་ཞིང་བརྩོན་འགྲུས་རྩོམ།
en: Become ordained in the Jina’s teachings, and engage in diligence.

source: །ཏིང་འཛིན་བརྒྱ་དང་སངས་རྒྱས་བརྒྱ་རྣམས་མཐོང་བར་བྱེད།
en: They attain a hundred samādhis and see a hundred buddhas.

source: །ཞིང་བརྒྱ་སྐྱོད་ཅིང་རབ་ཏུ་སྣང་བྱེད་ཀུན་ཏུ་འགྲོ།
en: They shake, illuminate, and go to a hundred realms.

source: །སེམས་ཅན་བརྒྱ་སྦྱོང་ཆོས་ཀྱི་སྒོ་ལ་འགོད་པ་བྱེད།
en: “They purify a hundred beings and enter a hundred Dharma doorways;

source: །བསྐལ་པ་བརྒྱར་འཇུག་ལུས་བརྒྱ་རབ་ཏུ་སྟོན་པ་བྱེད།
en: They enter a hundred eons and manifest a hundred bodies.

source: །རྒྱལ་བའི་སྲས་ཀྱང་བརྒྱ་ཡི་གྲངས་ཚངས་ཡོངས་སུ་སྟོན།
en: They teach a full hundred bodhisattvas,

source: །དེ་ཡི་གོང་ན་སྨོན་མཆོག་སྟོབས་ལྡན་ཚད་ཀྱང་མྱེད།
en: And after that they make countless powerful, supreme prayers.

source: །བདག་གིས་དོན་དུ་མདོར་བསྡུས་ཏེ།
en: “I have summarized the meaning

source: །ས་རྣམས་ཁྱེད་ལ་བཤད་པ་བྱས།
en: And explained the bhūmis to you.

source: །རྒྱ་ཆེ་བསྐལ་པ་བྱེ་བར་ཡང་།
en: Even in ten million eons

source: །ཐམས་ཅད་ཟད་པར་མི་ནུས་སོ།
en: I could not finish it all in detail.” In that way the bodhisattvas

source: །དེ་ལྟར་ས་ཡི་དང་པོ་འདི།
en: Were taught this first bhūmi Of the supreme bodhisattvas

source: །འཇིག་རྟེན་ཀུན་ལ་ཕན་སེམས་པའི།
en: Who wish to benefit all beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་མཆོག་རྣམས་ལ།
en: The bodhisattvas, having heard

source: །རྒྱལ་བའི་སྲས་ཀྱིས་བསྟན་པ་ཡིན།
en: Of this sublime state,

source: །རབ་ཏུ་དགའ་བ་ཞེས་བྱ་སྟེ།
en: This beautiful supreme bhūmi,

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ།
en: The first bodhisattva bhūmi,

source: །ས་མཆོག་ཡིད་དུ་འོང་བ་འདི། །གནས་ཀྱི་དམ་པ་ཐོབ་གྱུར་ནས། །བདེ་བར་གཤེགས་པའི་སྲས་ཀྱི་རྣམས།
en: Which is called Perfect Joy,

source: །ཡིད་རྟོག་དང་ཞིང་རབ་ཏུ་དགའ།
en: Became filled with admiration and joy.

source: །ཀུན་ཀྱང་སྟན་ལས་ལངས་གྱུར་ཏེ།
en: They rose from their seats

source: །མཁའ་ཡི་དབྱིངས་ལ་མངོན་འཕགས་ནས།
en: And ascended to the sky,

source: །མེ་ཏོག་སིལ་མ་རབ་ཏུ་འཐོར།
en: Where they scattered flower petals

source: ལེགས་ཞེས་བྱ་བའི་ཚིག་ཀྱང་བརྗོད།
en: And declared, “Excellent!

source: །ཤེས་རབ་ཆེན་པོ་ལེགས་སོ་ལེགས།
en: It is excellent that you, Who have no fear and have great wisdom, Have taught this bhūmi,

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྟེ། །ས་འདི་ཁྱོད་ཀྱིས་ལེགས་པར་བཤད།
en: This conduct of the bodhisattvas.”

source: །འཁོར་འདི་རྣམ་པར་དང་ཞིང་གསལ།
en: The assembly was in a state of serenity,

source: །རྣམ་གྲོལ་ཟླ་བ་འདི་ཡང་འདྲི།
en: And Vimukti­candra asked this question:

source: །རྒྱལ་བའི་སྲས་ཀྱི་གོང་དུ་ཡང་།
en: “That which is next to be described

source: །ས་གཉིས་རབ་ཏུ་བརྗོད་པ་མཛོད།
en: Is the second bhūmi of the bodhisattvas.

source: །ཡིད་ཀྱི་རྟོག་པ་ཅི་འདྲ་བས།
en: “Through what kind of thoughts

source: །ས་གཉིས་པ་ནི་འཐོབ་འགྱུར་བ།
en: Is the second bhūmi attained?

source: །ཤེས་རབ་ཆེན་པོས་བཤད་པར་མཛོད།
en: Great wise one, explain it to us.

source: །རྒྱལ་བའི་སྲས་རྣམས་ཉན་པར་འདོད།
en: The bodhisattvas wish to hear it.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ།
en: The bodhisattva Vajra­garbha said, “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ས་དང་པོ་ལ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་དེས་གཉིས་པ་ལ་མངོན་པར་མོས་པ་ཡིན་ཏེ།
en: When the bodhisattva has perfectly mastered the first bhūmi, he aspires to the second bhūmi.

source: དེའི་སེམས་ཀྱི་བསམ་པ་བཅུ་འབྱུང་ངོ་།
en: There are ten kinds of thought that arise in his mind.

source: དྲང་པོའི་བསམ་པ་དང་། འཇམ་པའི་བསམ་པ་དང་། ལས་སུ་རུང་བའི་བསམ་པ་དང་། དུལ་བའི་བསམ་པ་དང་། ཞི་བའི་བསམ་པ་དང་། དགེ་བའི་བསམ་པ་དང་། མ་འདྲེས་པའི་བསམ་པ་དང་། མི་ལྟོས་པའི་བསམ་པ་དང་རླབས་པོ་ཆེའི་བསམ་པ་དང་། བདག་ཉིད་ཆེ་བའི་བསམ་པ་དང་། སེམས་ཀྱི་བསམ་པ་བཅུ་པོ་འདི་དག་འབྱུང་སྟེ།
en: They are (1) straightforward thought, ( ) serene thought, (3) capable thought, (4) tamed thought, (5) peaceful thought, (6) virtuous thought, (7) distinctive thought, (8) independent thought, (9) sublime thought, and (10) exalted thought. “Those are the ten kinds of thought that arise.

source: དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པ་དྲི་མ་བྲལ་བ་ལ་གནས་པ་ཡིན།
en: Through those he will be on Stainless, the second bodhisattva bhūmi.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ས་དྲི་མ་དང་བྲལ་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རང་བཞིན་གྱིས་སྲོག་གཅོད་པ་དང་བྲལ་བ་ཡིན་ཏེ།
en: “O jinaputras, the bodhisattva who is on the Stainless bodhisattva bhūmi will naturally possess the path of ten good actions. What are these ten? 1. “He does not kill:

source: དབྱིག་པ་སྤངས་མཚོན་ཆ་སྤངས། ཁོན་དུ་འཛིན་པ་སྤངས་ཤིང་ངོ་ཚ་དང་ལྡན་པས་སྲོག་ཆགས་སུ་གྱུར་པ་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བས་ཕན་འདོགས་ཤིང་བྱམས་པའི་སེམས་དང་ལྡན་པ་ཡིན་ཏེ།
en: He forsakes clubs, forsakes swords, forsakes revenge, feels shame, and is compassionate, and toward all living beings he has a loving mind and wishes to bring them benefit and happiness.

source: དེ་ཡིད་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཙམ་གྱིས་ཀྱང་སྲོག་ཆགས་ལ་འཚེ་བ་མི་བྱེད་ན་སེམས་ཅན་གཞན་ལ་སེམས་ཅན་དུ་འདུ་ཤེས་ཤིང་ཆེད་དུ་བསམས་ཏེ། ལུས་ལ་གཙེ་བ་ཆེན་པོ་བྱ་བ་ལྟ་ཅི་སྨོས།
en: He does not even have thoughts of harming beings, let alone of consciously causing physical harm to other beings, knowing that they are beings.

source: བདག་གི་ལོངས་སྤྱོད་གྱིས་ཆོག་ཤེས་ཤིང་གཞན་གྱི་ལོངས་སྤྱོད་ལ་རེ་བ་མེད་པས་མ་བྱིན་པར་ལེན་པ་དང་བྲལ་བ་ཡིན་ཏེ།
en: “He also does not take what is not given: He is content with his own possessions and does not desire the possessions of others.

source: དེ་གཞན་གྱིས་ཡོངས་སུ་བཟུང་བའི་དངོས་པོ་ལ་གཞན་གྱིས་ཡོངས་སུ་བཟུང་བར་འདུ་ཤེས་ཤིང་རྐུ་སེམས་ཉེ་བར་བཞག་སྟེ།
en: He perceives that things owned by others are the property of others and has a definite understanding of what is theft.

source: ཆུང་ངུ་ན་རྩྭ་དང་ལོ་མ་ཡང་མ་བྱིན་པར་མི་ལེན་ན་འཚོ་བའི་ཡོ་བྱད་གཞན་ལྟ་ཅི་སྨོས།
en: He will not take even a blade of grass or a leaf that is not given, let alone that which sustains life. 3. “He also does not practice sexual misconduct:

source: བདག་གི་ཆུང་མས་ཆོག་ཤེས་ཤིང་གཞན་གྱི་ཆུང་མ་ལ་རེ་བ་མེད་པས་འདོད་པས་ལོག་པར་གཡེམ་པ་དང་བྲལ་བ་ཡིན་ཏེ།
en: He is content with his own wife and does not desire the wife of another.

source: དེ་གཞན་གྱིས་ཡོངས་སུ་བཟུང་བའི་བུད་མྱེད་གཞན་གྱི་ཆུང་མ་རུས་དང་མཚན་མ་དང་ཆོས་ཀྱིས་བསྲུང་བ་རྣམས་ལ་ཆགས་སེམས་ཀྱང་མྱི་སྐྱེ་ན་གཉིས་ཀྱིས་གཉིས་ཕྲད་པར་བྱ་བ་ལྟ་ཅི་སྨོས།
en: He does not even have desire toward women who belong to others, toward the wives of others, or toward those prohibited because of family, signs, or Dharma, let alone have sexual intercourse with them. 4. “He also does not lie:

source: །ཡང་དག་པར་སྨྲ་ཞིང་བདེན་པར་སྨྲ་བ་དང་། དུས་སུ་སྨྲ་བ་དང་། ཚོད་དུ་སྨྲ་བ་ལ་ཇི་སྐད་དུ་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པས།
en: He speaks the truth, says what has occurred, speaks at the right time, speaks the right amount, and does what he says he will do.

source: བརྫུན་དུ་སྨྲ་བ་དང་བྲལ་བ་ཡིན་ཏེ། དེ་ཆུང་ངུ་ན་རྨི་ལམ་དུ་ཡང་བརྫུན་གྱི་ཚིག་མི་བརྗོད་ན།
en: He does not even tell a lie in his dreams, let alone tell a lie deliberately.

source: དེ་སེམས་ཅན་གྱི་དབྱེན་མི་བྱེད་ཅིང་མྱི་འཚེ་བ་ལ་ཞུགས་པས།
en: “He also does not slander:

source: ཕྲ་མའི་ཚིག་དང་བྲལ་བ་ཡིན་ཏེ། དེ་དག་དབྱེ་བའི་ཕྱིར་ཚུ་བི་ལས་ཐོས་ཤིང་ཕ་བིར་སྙོད་པ་མ་ཡིན། ཕ་བི་ལས་ཐོས་ནས་ཚུ་བིར་སྙོད་པ་མ་ཡིན་ཏེ།
en: He does not cause division and vexation between people and he does not repeat to one person what he has heard from another, nor does he then repeat what that person tells him back to the other.

source: འདུམ་པ་རྣམས་དབྱེ་བར་མི་བྱེད།
en: He does not drive apart those who are in harmony.

source: བྱེ་བ་རྣམས་ལ་དཔར་བས་མི་རྣོན་ཏེ།
en: He does not increase conflict.

source: །མི་འདུམ་པ་ལ་དགའ་ཞིང་མི་འདུམ་པ་ལ་མོས་པ་མ་ཡིན་པས་བདེན་ནམ་རྫུན་ཡང་རུང་མི་འདུམ་པར་བྱ་བའི་ཚིག་མི་སྨྲའོ།
en: He does not enjoy disharmony and does not delight in disharmony. He does not speak words that will create disharmony whether they are true or not.

source: །ཞེ་གཅོད་པའི་ཚིག་དང་བྲལ་བ་ཡིན་ཏེ།
en: “He also does not speak harsh words:

source: སྙོགས་པ་དང་། བརླང་བ་དང་། རྩུབ་པ་དང་། གཞན་ལ་གནོད་པ་དང་། ཞེ་སྣད་པར་གྱུར་པ་དང་། ཉེས་པ་ངོར་བརྗོད་པ་དང་། ཉེས་པ་ངོར་བརྗོད་པ་ལ་གཞོལ་བ་དང་། གྲོང་མའི་ཚིག་དང་། མ་རབས་ཀྱི་ཚིག་དང་། གཟུངས་སུ་བཟུང་བ་མ་ཡིན་པ་དང་། རྣར་མི་སྙན་པ་དང་། ཁྲོ་བ་དང་གཤེ་བ་ལས་བྱུང་བ་དང་། སྙིང་ན་བར་བྱེད་པ་དང་། ཡིད་ཡོངས་སུ་གདུང་བར་བྱེད་པ་དང་། མི་སྙན་པ་དང་། ཡིད་དུ་མི་འོང་བ་དང་། བདག་དང་གཞན་གྱི་སེམས་མ་རུང་བར་བྱེད་པའི་ཚིག་གི་རྣམ་པ་དེ་ལྟ་བུ་སྤངས་ཏེ།
en: His speech is not disturbing, abusive, rough, hurtful, wounding, criticizing, accusing, low, vile, worthless, unpleasant, filled with anger or rage, a cause for heartache, disagreeable, or destructive to his own mind and the minds of others.

source: གང་འདི་འཇམ་པ་དང་ཡིད་དུ་འོང་བ་དང་། སྙན་པ་དང་། གཟུངས་སུ་བཟུང་བ་དང་། རྣར་འོང་བ་དང་། སྙིང་དུ་སྡུག་པ་དང་། ཕོ་བྲང་འཁོར་གྱི་ཚིག་དང་། གཙིགས་པ་དང་། གསལ་བ་དང་། འགོ་བ་དང་མཉན་པར་འོས་པ་དང་། མི་གནས་པ་དང་། སྐྱེ་བོ་མང་པོ་དགའ་བར་འགྱུར་བ་དང་། སྐྱེ་བོ་མང་པོའི་ཡིད་དུ་འོང་བ་དང་། མཁས་པས་བསྔགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་ཞིང་བདེ་བར་འགྱུར་བ་དང་། ཡིད་བདེ་བར་བྱེད་པ་དང་། ཡིད་སིམ་པར་བྱེད་པ་དང་། བདག་དང་གཞན་གྱི་སེམས་དང་བར་བྱེད་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཞི་བར་བྱེད་པའི་ཚིག་གི་རྣམ་པ་དེ་ལྟ་བུ་དག་བརྗོད་དོ། །ཚིག་ཀྱལ་པ་སྤངས་པ་ཡིན་ཏེ།
en: He speaks words that are gentle, agreeable, pleasant, delightful, favorable, charming, respectable, valuable, clear, comprehensible, worth hearing, dependable, pleasing to many, agreeable to many people, and praised by the wise, and words that bring benefit and happiness to all beings, make the mind happy, bring the mind satisfaction, calm his own and others’ minds, and eliminate desire, anger, ignorance, and all kleśas. 7. “He has also forsaken idle talk:

source: ལེགས་པར་ལན་གློན་པའི་ཚིག་དང་། དུས་སུ་སྨྲ་བ་དང་། བདེན་པར་སྨྲ་བ་དང་། དོན་དུ་སྨྲ་བ་དང་། ཆོས་སུ་སྨྲ་བ་དང་། རིགས་པར་སྨྲ་བ་དང་། དུལ་བར་སྨྲ་བ་དང་། དུས་ལ་བབ་པར་ཤིན་ཏུ་གོ་བའི་གཏན་ཚིགས་དང་བཅས་པར་སྨྲ་བར་དེ་ཆུང་ངུ་ན་བཞད་གད་དུ་བྱ་བ་ཙམ་གྱི་ཚིག་ལ་ཡང་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡོངས་སུ་སྤོང་ན་དགོས་པ་དོན་དུ་གཉེར་ཅིང་ཚིག་གིས་རྣམ་པར་འཁྲུག་པ་ལྟ་ཅི་སྨོས།
en: He gives answers well, speaks at the appropriate time, speaks truthfully, speaks meaningfully, speaks of the Dharma, speaks logically, speaks with control, speaks with cause, and pays attention to the time. He even avoids telling stories that should not be told, let alone distracting speech.

source: ཆགས་སེམས་མེད་པ་ཡིན་ཏེ།
en: “He is also not covetous:

source: དེ་གཞན་གྱི་ནོར་དང་། གཞན་གྱི་འདོད་པ་དང་། གཞན་དབང་བའི་ཡོ་བྱད་གཞན་གྱིས་ཡོངས་སུ་བཟུང་བ་ལ་ཇི་ལྟར་ན། གང་གཞན་གྱི་ཡིན་པ་དེ་དག་བདག་གིར་འགྱུར་ཞེས་ཏེ།
en: He does not covet the wealth of others, the pleasures of others, the utensils of others, or the property of others.

source: ཆགས་སེམས་མི་བསྐྱེད་མི་རེ་མི་སྨོན་ཅིང་འདོད་པའི་སེམས་མི་བསྐྱེད་དོ།
en: He does not wish for, hope for, or desire them, thinking, ‘May what is theirs be mine.’

source: །གནོད་སེམས་དང་བྲལ་བ་ཡིན་ཏེ།
en: “He also has no malice:

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་དང་ཕན་པའི་སེམས་དང་སྙིང་བརྩེ་བའི་སེམས་དང་། བདེ་བའི་སེམས་དང་། འཇམ་པའི་སེམས་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་གདགས་པའི་སེམས་དང་། འབྱུང་པོ་ཐམས་ཅད་ལ་ཕན་ཞིང་སྙིང་བརྩེ་བའི་སེམས་དང་ལྡན་པས།
en: Toward all beings his mind has love, altruism, kindness, happiness, gentleness, the wish to benefit the entire world, and the wish to compassionately benefit all beings.

source: གང་འདི་ཁྲོ་བ་དང་། མདུད་པར་འཛིན་པ་དང་། ཐབ་དང་དྲི་མ་དང་གནོད་སེམས་དང་ཁོང་ཁྲོ་བ་ལ་སྩོགས་པ་དེ་དག་སྤངས་ཏེ།
en: He is without anger, enmity, the stain of hardheartedness, malevolence, rage, and so on.

source: གང་འདི་ཕན་པ་དང་ལྡན་པ། བྱམས་པ་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བར་བྱ་བའི་ཕྱིར་རྣམ་པར་རྟོག་ཅིང་། རྣམ་པར་དཔྱོད་པ་དེ་དག་ལ་རྣམ་པར་རྟོག་པ་ཡིན།
en: His contemplations are contemplations and examinations that are beneficial, loving, and bring benefit and happiness to beings. 10. “He has the true view:

source: ཡང་དག་པར་ལྟ་བ་དང་ལྡན་ཞིང་ངོ་མཚར་དང་བཀྲ་ཤིས་དང་། ངང་ཚུལ་ངན་པའི་ལྟ་བ་སྣ་ཚོགས་དང་བྲལ་བ་ཡིན་ཏེ།
en: He follows the correct path, which is marvelous, fortunate, and free of bad views.

source: ལྟ་བ་དྲང་ཞིང་གཡོ་མེད་ལ་སྒྱུ་མེད་པས་སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་ལ་བསམ་པ་ངེས་པ་ཡིན།
en: He has correct views, is without deception, is without duplicity, and has certainty in the Buddha, Dharma, and Saṅgha.

source: དེ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བསྲུང་ཞིང་འདི་ལྟར་སེམས་ཀྱི་བསམ་པ་མངོན་པར་སྒྲུབ་སྟེ།
en: “He always continuously maintains this path of the ten good actions. “He has these thoughts in his mind:

source: སེམས་ཅན་རྣམས་ཀྱི་ངན་སོང་དང་ངན་འགྲོ་དང་། ལོག་པར་ལྟུང་བ་ཡོད་པ་གང་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་མི་དགེ་བ་བཅུའི་ལམ་ཡོངས་སུ་བླངས་པའི་རྒྱུ་ལས་བྱུང་གིས་བདག་གིས་ནི་འདི་ལྟར་བདག་ཉིད་ཡང་དག་པའི་ནན་ཏན་ལ་གནས་ཏེ།
en: ‘All the falling of beings into the lower existences, the lower realms, is caused by adopting the path of the ten bad actions.

source: གཞན་ཡང་ཡང་དག་པའི་ནན་ཏན་ལ་དགོད་པར་བྱའོ། །ཡང་དག་པའི་ནན་ཏན་ལ་གནས་པར་བསྟན་ཏོ།
en: I shall myself maintain correct conduct, make others maintain correct conduct, and teach correct conduct to others.

source: བདག་ལོག་པའི་ནན་ཏན་ལ་གནས་ཤིང་། གཞན་ཡང་དག་པའི་ནན་ཏན་ལ་དགོད་པར་བྱ་བ་འདི་ནི་གནས་མེད་སྐབས་མེད་པ་སྟེ། འདི་ནི་མི་སྲིད་དོ།
en: If I myself maintain wrong conduct, there will be no possibility for me to establish others in correct conduct.’

source: །ཞེས་ནས་ཡང་དེ་འདི་ལྟར་རྣམ་པར་དཔྱོད་དེ།
en: “He contemplates in this way:

source: མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ཡོངས་སུ་བཟུང་བའི་རྒྱུས་སེམས་ཅན་དམྱལ་བ་དང་བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བ་རྣམས་ཡོད་པར་གྱུར་ཏོ།
en: ‘Following these paths of the ten bad actions causes beings to be reborn in the hells, as animals, and in Yama’s realm.

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་བཟུང་བས་ནི་མིར་སྐྱེ་བ་ལ་སོགས་པ་སྲིད་པའི་རྩེ་མོའི་བར་དུ་སྐྱེ་བ་ཡོད་པར་གྱུར་ཏོ།
en: Following the paths of the ten good actions causes beings to be reborn as humans and so on, up to the highest of existences.

source: །དེའི་གོང་དུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ཉི་ཙེའི་སེམས་དང་ཁམས་གསུམ་པས་སྐྲག་པའི་ཡིད་དང་། སྙིང་རྗེ་ཆེན་པོ་མེད་པ་དང་། གཞན་ལས་ཐོས་པའི་སྒྲའི་རྗེས་སུ་འབྲང་བའི་ཤེས་རབ་ཀྱིས་རྣམ་པར་ཡོངས་སུ་བསྒོམས་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཡོངས་སུ་སྒྲུབ་པོ།
en: ‘Higher than that, those who follow the path of the ten good actions but with a limited motivation and with a mind terrified of the three realms are without great compassion, and they meditate on the wisdom gained through following what they have heard from others who are practicing the Śrāvaka­yāna.

source: །དེའི་གོང་དུ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་དང་། རང་མངོན་པར་འཚང་རྒྱ་བ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། ཐབས་མཁས་པ་མེད་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་པར་ཁོང་དུ་ཆུད་པས་ཡོངས་སུ་སྦྱངས་ན།
en: ‘Higher than that, those who do not rely on others, attain enlightenment by themselves, are without great compassion and method, and gain realization through realizing profound dependent origination are practicing the Pratyeka­buddha­yāna.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡོངས་སུ་སྒྲུབ་པོ། །དེའི་གོང་དུ་ཡངས་ཤིང་ཚད་མེད་པའི་སེམས་དང་། སྙིང་བརྩེ་ཞིང་སྙིང་རྗེ་དང་ལྡན་པ་དང་། ཐབས་མཁས་པས་ཡང་དག་པར་གཟུང་བ་དང་། སྨོན་ལམ་ཆེན་པོ་ཤིན་ཏུ་གདབ་པ་དང་། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རྒྱ་ཆེན་པོ་ལ་དམྱིགས་པས་ཡོངས་སུ་སྦྱངས་ན། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་དག་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པའི་སྤྱོད་པ་རྒྱ་ཆེན་པོ་ཡོངས་སུ་བསྒྲུབ་པར་འགྱུར་རོ།
en: ‘Higher than that, those who have vast, immeasurable motivation, great kindness and compassion, possess skillful methods, make great prayers, do not abandon all beings, have the goal of the vast wisdom of buddhahood, and purify the bodhisattva bhūmis are practicing the vast, pure conduct of the perfections.

source: །དེའི་གོང་དུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ཉིད་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པར་ཡོངས་སུ་སྦྱངས་པས་སྟོབས་བཅུའི་སྟོབས་ཐོབ་པར་འགྱུར་བ་དང་། མི་འཇིགས་པ་བཞི་འཐོབ་པ་ནས་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་འགྲུབ་པ་ཡང་དག་པར་སྒྲུབ་བོ།
en: ‘Higher than that, those who purify themselves in the supreme way on the path of the ten good actions will attain the power of the ten strengths and the four confidences and will accomplish the supreme qualities of buddhahood.

source: །དེ་ལྟ་བས་ན་བདག་གིས་དགེ་བ་བཅུའི་ལས་མངོན་པར་བསྒྲུབ་དུ་འདྲ་བ་ལ་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་སྦྱང་ཞིང་མངོན་པར་བསྒྲུབ་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་ནས།
en: Therefore, I shall dedicate myself to the accomplishment of supreme purification in the practice of the ten good actions.’

source: དེ་འདི་ལྟར་ཡང་དག་པར་སློབ་སྟེ།
en: “He teaches in this way:
